## Production: load-balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| add    | `module.athena_access_logs.aws_athena_database.logs`                       |
|        | `module.athena_access_logs.aws_athena_named_query.lb_create_table[0]`      |
|        | `module.athena_access_logs.aws_athena_named_query.waf_all_requests[0]`     |
|        | `module.athena_access_logs.aws_athena_named_query.waf_blocked_requests[0]` |
|        | `module.athena_access_logs.aws_athena_named_query.waf_create_table[0]`     |
|        | `module.athena_access_logs.aws_athena_workgroup.logs`                      |
|        | `module.athena_bucket.aws_s3_bucket.this`                                  |
|        | `module.athena_bucket.aws_s3_bucket_public_access_block.this`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.athena_access_logs.aws_athena_database.logs will be created
  + resource "aws_athena_database" "logs" {
      + bucket        = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "access_logs"

      + encryption_configuration {
          + encryption_option = "SSE_S3"
        }
    }

  # module.athena_access_logs.aws_athena_named_query.lb_create_table[0] will be created
  + resource "aws_athena_named_query" "lb_create_table" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "LB: create table"
      + query     = <<-EOT
            CREATE EXTERNAL TABLE IF NOT EXISTS `access_logs.lb_logs` (
                type string,
                time string,
                elb string,
                client_ip string,
                client_port int,
                target_ip string,
                target_port int,
                request_processing_time double,
                target_processing_time double,
                response_processing_time double,
                elb_status_code int,
                target_status_code string,
                received_bytes bigint,
                sent_bytes bigint,
                request_verb string,
                request_url string,
                request_proto string,
                user_agent string,
                ssl_cipher string,
                ssl_protocol string,
                target_group_arn string,
                trace_id string,
                domain_name string,
                chosen_cert_arn string,
                matched_rule_priority string,
                request_creation_time string,
                actions_executed string,
                redirect_url string,
                lambda_error_reason string,
                target_port_list string,
                target_status_code_list string,
                classification string,
                classification_reason string,
                conn_trace_id string
                )
                ROW FORMAT SERDE 'org.apache.hadoop.hive.serde2.RegexSerDe'
                WITH SERDEPROPERTIES (
                'serialization.format' = '1',
                'input.regex' = 
            '([^ ]*) ([^ ]*) ([^ ]*) ([^ ]*):([0-9]*) ([^ ]*)[:-]([0-9]*) ([-.0-9]*) ([-.0-9]*) ([-.0-9]*) (|[-0-9]*) (-|[-0-9]*) ([-0-9]*) ([-0-9]*) \"([^ ]*) (.*) (- |[^ ]*)\" \"([^\"]*)\" ([A-Z0-9-_]+) ([A-Za-z0-9.-]*) ([^ ]*) \"([^\"]*)\" \"([^\"]*)\" \"([^\"]*)\" ([-.0-9]*) ([^ ]*) \"([^\"]*)\" \"([^\"]*)\" \"([^ ]*)\" \"([^\s]+?)\" \"([^\s]+)\" \"([^ ]*)\" \"([^ ]*)\" ?([^ ]*)?( .*)?')
                LOCATION 's3://cbs-satellite-472286471787/lb_logs/AWSLogs/472286471787/elasticloadbalancing/ca-central-1/';
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_named_query.waf_all_requests[0] will be created
  + resource "aws_athena_named_query" "waf_all_requests" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "WAF: all requests"
      + query     = <<-EOT
            SELECT 
                date_format(from_unixtime(timestamp / 1000e0), '%Y-%m-%d %T') as time, 
                httprequest.httpmethod, httprequest.uri, action, httprequest
            FROM "access_logs"."waf_logs"
            WHERE httprequest.uri <> '/healthcheck'
            ORDER BY time DESC;
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_named_query.waf_blocked_requests[0] will be created
  + resource "aws_athena_named_query" "waf_blocked_requests" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "WAF: blocked requests"
      + query     = <<-EOT
            WITH data AS (
                SELECT
                    date_format(from_unixtime(timestamp / 1000e0), '%Y-%m-%d') as time, header.value as host, action,
                    terminatingruleid,
                    httprequest.clientip, httprequest.country, httprequest.httpmethod, httprequest.uri
                FROM "access_logs"."waf_logs"
                CROSS JOIN UNNEST(httprequest.headers) AS t(header)
                WHERE lower(header.name) = 'host'
                AND action = 'BLOCK'
            )
            SELECT
                min(time) as start_date, max(time) as end_date,
                count(*) as num,
                clientip, country,
                array_join(array_agg(distinct terminatingruleid), ', ') as terminatingruleid,
                host,
                array_join(array_agg(distinct uri), ', ') as uris
            FROM data
            GROUP BY clientip, country, host
            ORDER BY end_date DESC
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_named_query.waf_create_table[0] will be created
  + resource "aws_athena_named_query" "waf_create_table" {
      + database  = "access_logs"
      + id        = (known after apply)
      + name      = "WAF: create table"
      + query     = <<-EOT
            CREATE EXTERNAL TABLE `access_logs.waf_logs`(
              `timestamp` bigint, 
              `formatversion` int, 
              `webaclid` string, 
              `terminatingruleid` string, 
              `terminatingruletype` string, 
              `action` string, 
              `terminatingrulematchdetails` array<
                                                struct<
                                                    conditiontype:string,
                                                    location:string,
                                                    matcheddata:array<string>
                                                       >
                                                >, 
              `httpsourcename` string, 
              `httpsourceid` string, 
              `rulegrouplist` array<
                                  struct<
                                      rulegroupid:string,
                                      terminatingrule:struct<
                                                          ruleid:string,
                                                          action:string,
                                                          rulematchdetails:string
                                                            >,
                                      nonterminatingmatchingrules:array<string>,
                                      excludedrules:string
                                        >
                                   >, 
             `ratebasedrulelist` array<
                                     struct<
                                         ratebasedruleid:string,
                                         limitkey:string,
                                         maxrateallowed:int
                                           >
                                      >, 
              `nonterminatingmatchingrules` array<
                                                struct<
                                                    ruleid:string,
                                                    action:string
                                                      >
                                                 >, 
              `requestheadersinserted` string, 
              `responsecodesent` string, 
              `httprequest` struct<
                                clientip:string,
                                country:string,
                                headers:array<
                                            struct<
                                                name:string,
                                                value:string
                                                  >
                                             >,
                                uri:string,
                                args:string,
                                httpversion:string,
                                httpmethod:string,
                                requestid:string
                                  >, 
              `labels` array<
                           struct<
                               name:string
                                 >
                            >, 
              `captcharesponse` struct<
                                    responsecode:string,
                                    solvetimestamp:string,
                                    failureReason:string
                                      > 
            )
            ROW FORMAT SERDE 'org.openx.data.jsonserde.JsonSerDe'
            STORED AS INPUTFORMAT 'org.apache.hadoop.mapred.TextInputFormat'
            OUTPUTFORMAT 'org.apache.hadoop.hive.ql.io.HiveIgnoreKeyTextOutputFormat'
            LOCATION 's3://cbs-satellite-472286471787/waf_acl_logs/AWSLogs/472286471787/'
        EOT
      + workgroup = "logs"
    }

  # module.athena_access_logs.aws_athena_workgroup.logs will be created
  + resource "aws_athena_workgroup" "logs" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "logs"
      + state         = "ENABLED"
      + tags          = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "PlatformGCArticles"
          + "Terraform"  = "true"
        }

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + result_configuration {
              + output_location = (known after apply)

              + encryption_configuration {
                  + encryption_option = "SSE_S3"
                }
            }
        }
    }

  # module.athena_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "gc-articles-production-athena"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformGCArticles"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformGCArticles"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire-objects"

          + expiration {
              + days = 30
            }
        }

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.athena_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.cloudfront_logs,
  on s3.tf line 4, in resource "aws_s3_bucket" "cloudfront_logs":
   4: resource "aws_s3_bucket" "cloudfront_logs" {

server_side_encryption_configuration is deprecated. Use the
aws_s3_bucket_server_side_encryption_configuration resource instead.

(and 8 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress_cloudfront"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress_new[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.wordpress_new_cloudfront[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cache_buster"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.firehose_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.cache_buster"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket.cloudfront_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.wordpress_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.wordpress_waf_alb"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
